vertical-pod-autoscaler/experiments/sn-pbr-throughput/15/compose.log
Running 15m test @ http://10.101.59.64:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 18.734ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 17.309ms, rate sampling interval: 41ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   391.57ms  401.94ms   1.82s    86.33%
    Req/Sec     4.96     10.45    48.00     79.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  268.03ms
 75.000%  542.72ms
 90.000%  911.36ms
 99.000%    1.82s 
 99.900%    2.85s 
 99.990%    3.80s 
 99.999%    4.04s 
100.000%    4.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.511     0.000000            1         1.00
      34.367     0.100000          887         1.11
      77.759     0.200000         1769         1.25
     132.607     0.300000         2652         1.43
     194.815     0.400000         3536         1.67
     268.031     0.500000         4419         2.00
     310.783     0.550000         4862         2.22
     356.351     0.600000         5303         2.50
     410.879     0.650000         5745         2.86
     473.087     0.700000         6189         3.33
     542.719     0.750000         6631         4.00
     587.263     0.775000         6850         4.44
     633.343     0.800000         7071         5.00
     699.391     0.825000         7292         5.71
     757.247     0.850000         7515         6.67
     825.855     0.875000         7735         8.00
     868.863     0.887500         7845         8.89
     913.407     0.900000         7956        10.00
     957.439     0.912500         8067        11.43
    1008.127     0.925000         8177        13.33
    1089.535     0.937500         8286        16.00
    1139.711     0.943750         8341        17.78
    1191.935     0.950000         8398        20.00
    1241.087     0.956250         8452        22.86
    1303.551     0.962500         8507        26.67
    1370.111     0.968750         8562        32.00
    1411.071     0.971875         8590        35.56
    1446.911     0.975000         8619        40.00
    1496.063     0.978125         8647        45.71
    1565.695     0.981250         8673        53.33
    1628.159     0.984375         8700        64.00
    1682.431     0.985938         8714        71.11
    1733.631     0.987500         8728        80.00
    1788.927     0.989062         8742        91.43
    1850.367     0.990625         8756       106.67
    1951.743     0.992188         8769       128.00
    2001.919     0.992969         8776       142.22
    2053.119     0.993750         8783       160.00
    2150.399     0.994531         8790       182.86
    2240.511     0.995313         8798       213.33
    2316.287     0.996094         8804       256.00
    2340.863     0.996484         8807       284.44
    2379.775     0.996875         8811       320.00
    2433.023     0.997266         8814       365.71
    2480.127     0.997656         8818       426.67
    2646.015     0.998047         8821       512.00
    2691.071     0.998242         8823       568.89
    2787.327     0.998437         8825       640.00
    2799.615     0.998633         8826       731.43
    2840.575     0.998828         8828       853.33
    2854.911     0.999023         8830      1024.00
    2887.679     0.999121         8831      1137.78
    2975.743     0.999219         8832      1280.00
    2975.743     0.999316         8832      1462.86
    3039.231     0.999414         8833      1706.67
    3137.535     0.999512         8834      2048.00
    3145.727     0.999561         8835      2275.56
    3145.727     0.999609         8835      2560.00
    3145.727     0.999658         8835      2925.71
    3389.439     0.999707         8836      3413.33
    3389.439     0.999756         8836      4096.00
    3801.087     0.999780         8837      4551.11
    3801.087     0.999805         8837      5120.00
    3801.087     0.999829         8837      5851.43
    3801.087     0.999854         8837      6826.67
    3801.087     0.999878         8837      8192.00
    4036.607     0.999890         8838      9102.22
    4036.607     1.000000         8838          inf
#[Mean    =      391.568, StdDeviation   =      401.939]
#[Max     =     4034.560, Total count    =         8838]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8955 requests in 15.00m, 1.84MB read
  Socket errors: connect 0, read 0, write 4, timeout 17
Requests/sec:      9.95
Transfer/sec:      2.09KB