vertical-pod-autoscaler/experiments/sn-pbr-throughput/15/home.log
Running 15m test @ http://10.101.59.64:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 30.055ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.327ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.77s    12.37s   32.26s    77.28%
    Req/Sec    30.60     45.80   181.00     77.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   75.01ms
 75.000%  238.98ms
 90.000%   29.79s 
 99.000%   32.26s 
 99.900%   33.85s 
 99.990%   34.34s 
 99.999%   34.44s 
100.000%   34.44s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.598     0.000000            1         1.00
      17.647     0.100000         5276         1.11
      26.927     0.200000        10561         1.25
      38.175     0.300000        15834         1.43
      53.983     0.400000        21110         1.67
      75.007     0.500000        26382         2.00
      88.895     0.550000        29025         2.22
     105.791     0.600000        31664         2.50
     127.935     0.650000        34294         2.86
     163.199     0.700000        36938         3.33
     238.975     0.750000        39568         4.00
   26705.919     0.775000        40896         4.44
   27492.351     0.800000        42213         5.00
   28229.631     0.825000        43559         5.71
   28835.839     0.850000        44844         6.67
   29360.127     0.875000        46181         8.00
   29589.503     0.887500        46871         8.89
   29786.111     0.900000        47493        10.00
   30015.487     0.912500        48152        11.43
   30294.015     0.925000        48819        13.33
   30572.543     0.937500        49493        16.00
   30703.615     0.943750        49807        17.78
   30834.687     0.950000        50146        20.00
   30998.527     0.956250        50465        22.86
   31162.367     0.962500        50802        26.67
   31309.823     0.968750        51126        32.00
   31391.743     0.971875        51289        35.56
   31473.663     0.975000        51438        40.00
   31571.967     0.978125        51608        45.71
   31752.191     0.981250        51774        53.33
   31948.799     0.984375        51940        64.00
   32047.103     0.985938        52016        71.11
   32129.023     0.987500        52097        80.00
   32210.943     0.989062        52191        91.43
   32292.863     0.990625        52267       106.67
   32407.551     0.992188        52344       128.00
   32505.855     0.992969        52388       142.22
   32604.159     0.993750        52431       160.00
   32751.615     0.994531        52474       182.86
   32849.919     0.995313        52510       213.33
   32980.991     0.996094        52551       256.00
   33079.295     0.996484        52571       284.44
   33161.215     0.996875        52598       320.00
   33210.367     0.997266        52615       365.71
   33259.519     0.997656        52633       426.67
   33341.439     0.998047        52657       512.00
   33406.975     0.998242        52666       568.89
   33488.895     0.998437        52674       640.00
   33685.503     0.998633        52685       731.43
   33816.575     0.998828        52699       853.33
   33882.111     0.999023        52709      1024.00
   33914.879     0.999121        52712      1137.78
   33947.647     0.999219        52720      1280.00
   33947.647     0.999316        52720      1462.86
   34013.183     0.999414        52728      1706.67
   34078.719     0.999512        52734      2048.00
   34078.719     0.999561        52734      2275.56
   34111.487     0.999609        52739      2560.00
   34111.487     0.999658        52739      2925.71
   34177.023     0.999707        52743      3413.33
   34209.791     0.999756        52745      4096.00
   34209.791     0.999780        52745      4551.11
   34242.559     0.999805        52747      5120.00
   34242.559     0.999829        52747      5851.43
   34275.327     0.999854        52749      6826.67
   34340.863     0.999878        52751      8192.00
   34340.863     0.999890        52751      9102.22
   34340.863     0.999902        52751     10240.00
   34373.631     0.999915        52753     11702.86
   34373.631     0.999927        52753     13653.33
   34373.631     0.999939        52753     16384.00
   34439.167     0.999945        52756     18204.44
   34439.167     1.000000        52756          inf
#[Mean    =     6769.338, StdDeviation   =    12372.536]
#[Max     =    34406.400, Total count    =        52756]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  53410 requests in 15.00m, 459.43MB read
  Socket errors: connect 0, read 0, write 8, timeout 0
Requests/sec:     59.34
Transfer/sec:    522.70KB